<?php  
/**
* Преобразует текст в другой язык
*
* @todo 	- доработать словари чтобы не дублировались цифры в словарях
*  			- разобраться с регистрами
*/
class HlpConvertStr {
	/**
	* Делает преобразование
	*
	* @param 	string 	$text - текст который надо преоразовать 
	* @param 	array 	$word_book - словарь преобразования 
	* @return 	string 	преобразованая строка
	*
	* @see 		this::ruToEn(), 
	*/
	private static function convert($text, $word_book)
	{
		$str = '';
		//количество символов в строке (много битовая кодировка)
		$count = mb_strlen($text, 'utf8');
		//проходим циклом по тексту
		for ($i=0; $i < $count; $i++) {
			//получаем букву в однобитовой кодировке
			$letter = mb_substr($text, $i, 1, 'utf-8');
			//получаем преобразованую букву на анг 
			$letterNew = array_key_exists($letter, $word_book) ? $word_book[$letter] : ''; 
			$str .= $letterNew;
		}
		
		return $str;
	}

/******************************************************************************************/
	/**
	* Преоразует русский текст в английский
	*
	* @param 	string 	$text - текст который нужно преобразовать
	* @return 	string 	преобразованый текст
	* 
	* @uses 	this::convert 		делает преобразование текста по задоному словарю
	*/
	public static function ruToEn($text)
	{
		//словарь
		$word_book = array(
								'А'=>'a','Б'=>'b','В'=>'v','Г'=>'g','Д'=>'d',
								'Е'=>'e','Ё'=>'e','Ж'=>'zh','З'=>'z','И'=>'i',
								'Й'=>'j','К'=>'k','Л'=>'l','М'=>'m','Н'=>'n',
								'О'=>'o','П'=>'p','Р'=>'r','С'=>'s','Т'=>'t',
								'У'=>'u','Ф'=>'f','Х'=>'kh','Ц'=>'ts','Ч'=>'ch',
								'Ш'=>'sh','Щ'=>'sh','Ы'=>'y','Э'=>'e','Ю'=>'yu',
								'Я'=>'ya',
								'а'=>'a','б'=>'b','в'=>'v','г'=>'g','д'=>'d',
								'е'=>'e','ё'=>'e','ж'=>'zh','з'=>'z','и'=>'i',
								'й'=>'j','к'=>'k','л'=>'l','м'=>'m','н'=>'n',
								'о'=>'o','п'=>'p','р'=>'r','с'=>'s','т'=>'t',
								'у'=>'u','ф'=>'f','х'=>'kh','ц'=>'ts','ч'=>'ch',
								'ш'=>'sh','щ'=>'sh','ы'=>'y','э'=>'e','ю'=>'yu',
								'я'=>'ya',
								'A'=>'a', 'B'=>'b', 'C'=>'c', 'D'=>'d', 'E'=>'e',
								'F'=>'f', 'G'=>'g', 'H'=>'h', 'I'=>'i', 'J'=>'j',
								'K'=>'k', 'L'=>'l', 'M'=>'m', 'N'=>'n', 'O'=>'o',
								'P'=>'p', 'Q'=>'q', 'R'=>'r', 'S'=>'s', 'T'=>'t',
								'U'=>'u', 'V'=>'v', 'W'=>'w', 'X'=>'x', 'Y'=>'y',
								'Z'=>'z',
								'a'=>'a', 'b'=>'b', 'c'=>'c', 'd'=>'d', 'e'=>'e',
								'f'=>'f', 'g'=>'g', 'h'=>'h', 'i'=>'i', 'j'=>'j',
								'k'=>'k', 'l'=>'l', 'm'=>'m', 'n'=>'n', 'o'=>'o',
								'p'=>'p', 'q'=>'q', 'r'=>'r', 's'=>'s', 't'=>'t',
								'u'=>'u', 'v'=>'v', 'w'=>'w', 'x'=>'x', 'y'=>'y',
								'z'=>'z', 
								' '=>'_','_'=>'_','0'=>'0','1'=>'1','2'=>'2',
								'3'=>'3','4'=>'4','5'=>'5','6'=>'6',
								'7'=>'7','8'=>'8','9'=>'9', 
								'.'=>'.', '-'=>'_'
							);
		//преобразовывает
		return self::convert($text, $word_book);
	}
/**********************************************************************************/

}





































